Documents/ЗаявкаНаВозврат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявкаНаВозврат</Name>
			<BasedOn>
				<xr:Item>Document.РеализацияТоваровУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИзмененияЭтапаЭкспертизы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реализация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СертифицированнаяТорговаяТочка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяОтправкаТовараКлиенту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтампВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапЭкспертизы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭтапыЭкспретизы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОформленоНаПланшете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлПочтаКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСклада_СтороннийСклад</Name>
							<Comment>СправочникСсылка.СторонниеСклады</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СторонниеСклады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиИзРТУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтрокиКМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КодыМаркировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСтрокиКМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМаркировки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

WebServices/Returns_For_Portal/Ext/Module.bsl
Функция Returns_For_Portal(IncomingSettings)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис Returns_For_Portal", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. Returns_For_Portal");
	ЗаписьЖурналаРегистрации("Web-сервис Returns_For_Portal", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Параметры. Returns_For_Portal: " + Символы.ПС + МСКWEB.ПолучитьОписаниеПараметровВэбСервиса(IncomingSettings)); 	
	
	Результат = Returns_For_Portal_(IncomingSettings);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис Returns_For_Portal", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. Returns_For_Portal " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
	
	Возврат Результат; 		

КонецФункции

Функция Returns_For_Portal_(ПараметрыОтбора) Экспорт
	
	//получаем входящие параметры
	пДатаНачалаОтчета	  = Дата(ПараметрыОтбора.BEGIN_DATE_);
	пДатаКонцаОтчета	  = Дата(ПараметрыОтбора.END_DATE_);
	пКодКонтрагентаПортал = ПараметрыОтбора.KONTRAGENT_;  	
	пАртикулТовара = ПараметрыОтбора.ARTICUL;
	пНомерДокумента = ПараметрыОтбора.NOMER_DOC;
	
	//разложим строку Филиалов
	пФилиалы			  = СокрЛП(ПараметрыОтбора.FILIALS); 
	пСписокФилиалов = Новый Массив;

	Если ЗначениеЗаполнено(пФилиалы)  И НЕ Константы.НеПроверятьФилиалВВэбСервисах.Получить() Тогда
		пСписокФилиалов = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СокрЛП(пФилиалы), ",");
	КонецЕсли;

	пСтатусы			  = СокрЛП(ПараметрыОтбора.DSTATE_); 
	пСписокСтатусов = Новый Массив;
	
	Если ЗначениеЗаполнено(пСтатусы) Тогда
		пСписокСтатусов = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СокрЛП(пСтатусы), ",");
	КонецЕсли;
	
	ИДАвардаКонтрагента = СтрЗаменить(СокрЛП(пКодКонтрагентаПортал),Символы.НПП, "");

	//Создаем объект для возврата
	ТипОтвет					= ФабрикаXDTO.Тип(Метаданные.WebСервисы.Returns_For_Portal.ПространствоИмен, "RS_Returns_For_Portal");
	РезультатДляВозвратаПорталу = ФабрикаXDTO.Создать(ТипОтвет);
	
	//Создаем строку ответа
	ТипСтрокаОтвета			    = ФабрикаXDTO.Тип(Метаданные.WebСервисы.Returns_For_Portal.ПространствоИмен, "Out_Returns_For_Portal");  
	
	//Ищем контрагента
	ИскатьПоКодуМДМ = СтрДлина(ИДАвардаКонтрагента) = 36;
	
	Если ИскатьПоКодуМДМ Тогда  
		пКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", ИДАвардаКонтрагента);	
	Иначе
		пКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("IDАварда", ИДАвардаКонтрагента);	
	КонецЕсли;
	
	Если НЕ пКонтрагент.Пустая() Или НЕ пСписокФилиалов.Количество() = 0 Тогда
		
		ЗапросЗаказовПоСтатусам = Новый Запрос;
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("ДатаНач", ?(ЗначениеЗаполнено(пДатаНачалаОтчета), НачалоДня(пДатаНачалаОтчета), НачалоДня(ТекущаяДата() - 86400*14)));
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("ДатаКон", ?(ЗначениеЗаполнено(пДатаКонцаОтчета), КонецДня(пДатаКонцаОтчета), КонецДня(ТекущаяДата())));
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("IDАварда", ИДАвардаКонтрагента);
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("СписокИД", пСписокФилиалов);
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("Артикул", ?(СокрЛП(пАртикулТовара) <> "", "%" + СокрЛП(СтрЗаменить(пАртикулТовара, " ", "")) + "%", ""));
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("НомерДокумента", СокрЛП(пНомерДокумента));
		
		ДокументВозврата = Неопределено;
		
		Если ЗначениеЗаполнено(СокрЛП(пНомерДокумента)) Тогда
			
			Док = Документы.ЗаявкаНаВозврат.НайтиПоНомеру(пНомерДокумента, пДатаКонцаОтчета);
			
			Если Не ЗначениеЗаполнено(Док) тогда
				
				Док = Документы.ЗаявкаНаВозврат.НайтиПоНомеру(пНомерДокумента, пДатаНачалаОтчета);
				
				Если ЗначениеЗаполнено(Док) тогда
					ДокументВозврата = Док;
				КонецЕсли;
				
			Иначе
				ДокументВозврата = Док;
			КонецЕсли;
			
		КонецЕсли;
		
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("ДокументВозврата", ДокументВозврата);
				
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка
		|ПОМЕСТИТЬ ТаблицаКлиентов
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ГоловнойКонтрагент.IDАварда = &IDАварда
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаявкаНаВозвратТовары.Ссылка КАК Заявка,
		|	ЗаявкаНаВозвратТовары.Номенклатура,
		|	СУММА(ЗаявкаНаВозвратТовары.Цена) КАК Цена,
		|	СУММА(ЗаявкаНаВозвратТовары.Количество) КАК Количество,
		|	ЗаявкаНаВозвратТовары.НомерСтроки,
		|	ЗаявкаНаВозвратТовары.Тип
		|ПОМЕСТИТЬ ТаблЧасть
		|ИЗ
		|	ТаблицаКлиентов КАК ТаблицаКлиентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкаНаВозвратТовары
		|			ПО РеализацияТоваровУслуг.Ссылка = ЗаявкаНаВозвратТовары.Ссылка.Реализация
		|		ПО ТаблицаКлиентов.Ссылка = РеализацияТоваровУслуг.Грузополучатель
		|ГДЕ
		|	НЕ ЗаявкаНаВозвратТовары.Ссылка.ПометкаУдаления
		|	И ВЫБОР
		|			КОГДА &НомерДокумента = """"
		|				ТОГДА ЗаявкаНаВозвратТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|			ИНАЧЕ ЗаявкаНаВозвратТовары.Ссылка = &ДокументВозврата
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаявкаНаВозвратТовары.Ссылка,
		|	ЗаявкаНаВозвратТовары.Номенклатура,
		|	ЗаявкаНаВозвратТовары.НомерСтроки,
		|	ЗаявкаНаВозвратТовары.Тип
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблЧасть.Заявка,
		|	ТаблЧасть.Номенклатура,
		|	ТаблЧасть.Цена,
		|	ТаблЧасть.Количество,
		|	ТаблЧасть.НомерСтроки,
		|	ТаблЧасть.Тип
		|ПОМЕСТИТЬ ТаблЗаказа
		|ИЗ
		|	ТаблЧасть КАК ТаблЧасть
		|ГДЕ
		|	(&Артикул = """"
		|			ИЛИ ТаблЧасть.Номенклатура.КодПроизводителя ПОДОБНО &Артикул)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблЗаказа.Заявка,
		|	ТаблЗаказа.Номенклатура,
		|	СУММА(ТаблЗаказа.Цена) КАК Цена,
		|	СУММА(ТаблЗаказа.Количество) КАК Количество,
		|	ТаблЗаказа.НомерСтроки,
		|	ТаблЗаказа.Тип,
		|	СчетФактураВыданный.Ссылка КАК СчетФактура
		|ПОМЕСТИТЬ ИтоговаяТаблица
		|ИЗ
		|	ТаблЗаказа КАК ТаблЗаказа
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|		ПО ТаблЗаказа.Заявка.Реализация = СчетФактураВыданный.ДокументОснование
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблЗаказа.Заявка,
		|	ТаблЗаказа.Номенклатура,
		|	ТаблЗаказа.НомерСтроки,
		|	ТаблЗаказа.Тип,
		|	СчетФактураВыданный.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИтоговаяТаблица.Заявка.Ссылка КАК Ссылка,
		|	ИтоговаяТаблица.Заявка.Номер КАК DCODE_6002,
		|	ИтоговаяТаблица.Заявка.Дата КАК DDATE_6002,
		|	ИтоговаяТаблица.Заявка.Реализация.Грузополучатель.Наименование КАК FILIAL_NAME,
		|	ИтоговаяТаблица.Заявка.Комментарий КАК DNOTE,
		|	ИтоговаяТаблица.Заявка.Реализация.ВалютаДокумента.Наименование КАК VALUTA_NAME,
		|	ИтоговаяТаблица.Заявка.Реализация.ДоговорКонтрагента.Наименование КАК DOGOVOR_NAME,
		|	ИтоговаяТаблица.Заявка.Реализация.Склад.Наименование КАК SKLAD_NAME,
		|	ВЫРАЗИТЬ(ИтоговаяТаблица.Заявка.Реализация.Организация.Наименование КАК СТРОКА(80)) КАК OUR_FIRM,
		|	""Москворечье Трейдинг"" КАК UR_LICO,
		|	ВЫРАЗИТЬ(ИтоговаяТаблица.Заявка.Реализация.Контрагент.Наименование КАК СТРОКА(80)) КАК KONTRAGENT_NAME,
		|	ИтоговаяТаблица.Номенклатура.Код КАК INV_NUM,
		|	ИтоговаяТаблица.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК KOEF,
		|	ИтоговаяТаблица.Количество КАК KOL_VO,
		|	ИтоговаяТаблица.Цена КАК PRICE,
		|	"""" КАК TOVAR_PRIMECH,
		|	ИтоговаяТаблица.Количество * ИтоговаяТаблица.Цена КАК SUMMA,
		|	ИтоговаяТаблица.Номенклатура.КодПроизводителя КАК ARTICUL_OUT,
		|	ИтоговаяТаблица.Номенклатура.Наименование КАК TOVAR_NAME,
		|	ИтоговаяТаблица.Номенклатура.Родитель.Наименование КАК BREND,
		|	ИтоговаяТаблица.Номенклатура.ЕдиницаХраненияОстатков.Наименование КАК ED_IZM,
		|	ИтоговаяТаблица.Номенклатура КАК Номенклатура,
		|	ИтоговаяТаблица.НомерСтроки КАК EID,
		|	ИтоговаяТаблица.Заявка.Реализация КАК Реализация,
		|	ВЫБОР
		|		КОГДА ИтоговаяТаблица.Тип = ""Возврат""
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК IS_RECLAMAC,
		|	ВЫРАЗИТЬ(ИтоговаяТаблица.Заявка.Реализация.Организация.Наименование КАК СТРОКА(80)) КАК ORG,
		|	ВЫБОР
		|		КОГДА ИтоговаяТаблица.Заявка.Реализация.Организация.ИНН = """"
		|			ТОГДА ""-""
		|		ИНАЧЕ ВЫРАЗИТЬ(ИтоговаяТаблица.Заявка.Реализация.Организация.ИНН КАК СТРОКА(10))
		|	КОНЕЦ КАК INN,
		|	ВЫБОР
		|		КОГДА ИтоговаяТаблица.Заявка.Реализация.Организация.КПП = """"
		|			ТОГДА ""-""
		|		ИНАЧЕ ВЫРАЗИТЬ(ИтоговаяТаблица.Заявка.Реализация.Организация.КПП КАК СТРОКА(9))
		|	КОНЕЦ КАК KPP,
		|	ИтоговаяТаблица.СчетФактура
		|ИЗ
		|	ИтоговаяТаблица КАК ИтоговаяТаблица
		|
		|УПОРЯДОЧИТЬ ПО
		|	DDATE_6002 УБЫВ,
		|	DCODE_6002 УБЫВ,
		|	EID
		|ИТОГИ
		|	СУММА(KOL_VO),
		|	СУММА(PRICE),
		|	СУММА(SUMMA)
		|ПО
		|	Ссылка,
		|	Номенклатура";
		
		Если ИскатьПоКодуМДМ Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ".IDАварда", ".КодМДМ");
		КонецЕсли;
		
		ТаблСФ = Новый ТаблицаЗначений;
		ТаблСФ.Колонки.Добавить("Документ");
		ТаблСФ.Колонки.Добавить("SF");
		ТаблСФ.Колонки.Добавить("DATE_SF");
		ТаблСФ.Колонки.Добавить("SALE_NAKL");
		
		ЗапросЗаказовПоСтатусам.Текст = ТекстЗапроса;
		
		РезультатЗапросаЗаказовПоСтатусам = ЗапросЗаказовПоСтатусам.Выполнить();
		
		Если НЕ РезультатЗапросаЗаказовПоСтатусам.Пустой() Тогда
			
			ВыборкаРезультата1 = РезультатЗапросаЗаказовПоСтатусам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаРезультата1.Следующий() Цикл
				
				ВыборкаРезультата2 = ВыборкаРезультата1.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаРезультата2.Следующий() Цикл
					
					ВыборкаРезультата = ВыборкаРезультата2.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыборкаРезультата.Следующий() Цикл				
						
						СтрокаВозврата = ФабрикаXDTO.Создать(ТипСтрокаОтвета);
						ЗаполнитьЗначенияСвойств(СтрокаВозврата,ВыборкаРезультата);
						
						СтрокаВозврата.DID_6002    = СокрЛП(ВыборкаРезультата.Ссылка.УникальныйИдентификатор());
						СтрокаВозврата.DDATE_6002 = Формат(ВыборкаРезультата.DDATE_6002, "ДФ='yyyy-MM-ddTHH:mm:ss'");
						
						СтрокаТЗ = ПолучитьДанныеСФ(ВыборкаРезультата.Ссылка, ВыборкаРезультата.СчетФактура, ТаблСФ);
						ЗаполнитьЗначенияСвойств(СтрокаВозврата,СтрокаТЗ);						
					
						Статус = ПолучитьСтатусЗаявки(ВыборкаРезультата.Ссылка);
						СтрокаВозврата.STATUS = Статус.Статус;
						СтрокаВозврата.STATUS_ID = Статус.СтатусИД;
						СтрокаВозврата.COLOR = Статус.Цвет;
						
						Если СтрокаВозврата.STATUS_ID = 220 ИЛИ СтрокаВозврата.STATUS_ID = 230 тогда
							СтрокаВозврата.FLAG_1 = 1;
						Иначе
							СтрокаВозврата.FLAG_1 = 0;
						КонецЕсли;
						
						РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);
						
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЦикла;	
			
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат РезультатДляВозвратаПорталу;
	
КонецФункции

Функция ПолучитьСтатусЗаявки(Заявка)
	
	Рез = Новый Структура;
	Рез.Вставить("Статус","");
	Рез.Вставить("СтатусИД",0);
	Рез.Вставить("Цвет","");
	
	Если Заявка.Статус = "Отменен" тогда
		Рез.Статус = "Отменен клиентом";
		Рез.СтатусИД = 280;
	ИначеЕсли Заявка.Статус = "Отказ в возврате" тогда
		Рез.Статус = "Отказ в возврате";
		Рез.СтатусИД = 210;
		Рез.Цвет = "FF0000";
	ИначеЕсли Заявка.Статус = "Принят" тогда
		Рез.Статус = "Принят";
		Рез.СтатусИД = 250;
	ИначеЕсли Заявка.Статус = "На доставке" тогда
		Рез.Статус = "На доставке";
		Рез.СтатусИД = 240;
		Рез.Цвет = "ADFF2F"; 		
	ИначеЕсли Заявка.Статус = "Согласован" тогда
		Рез.Статус = "Согласован";
		Рез.СтатусИД = 230;
		Рез.Цвет = "ADFF2F";
	ИначеЕсли Заявка.Статус = "На согласовании" тогда
		Рез.Статус = "На согласовании";
		Рез.СтатусИД = 220;
		Рез.Цвет = "FFFF00";
	ИначеЕсли Заявка.Статус = "Требуется экспертиза" тогда
		Рез.Статус = "Требуется экспертиза";
		Рез.СтатусИД = 240;
		Рез.Цвет = "FFFF00";		
	ИначеЕсли Заявка.Статус = "На экспертизе" тогда
		Рез.Статус = "На экспертизе";
		Рез.СтатусИД = 240;
		Рез.Цвет = "FFFF00";
	КонецЕсли;
	
	Возврат Рез;

КонецФункции

Функция ПолучитьДанныеСФ(Документ, СФ, ТЗ)
	
	Строка = ТЗ.Найти(Документ);
	
	Если Строка = Неопределено тогда
		
		Строка = ТЗ.Добавить();
		Строка.Документ = Документ;
		СчетФактура = СФ;
		
		Если ЗначениеЗаполнено(СчетФактура) тогда
			
			Строка.SF = ОбщегоНазначения.ПолучитьНомерНаПечать(СчетФактура) + " от " + Формат(СчетФактура.Дата, "ДЛФ=Д");
			Строка.DATE_SF = Формат(СчетФактура.Дата, "ДФ='yyyy-MM-ddTHH:mm:ss'");
			Строка.SALE_NAKL = Строка.SF;
			
		Иначе
			
			Строка.SF = Документ.Реализация.Номер + " от " + Документ.Реализация.Дата; 
			Строка.DATE_SF = "0001-01-01T00:00:00";
			Строка.SALE_NAKL = Документ.Реализация.Номер + " от " + Документ.Реализация.Дата;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Строка;

КонецФункции
